# Part 3

# Normalizing Genres

In [1]:
import pandas as pd
import numpy as np
import os, json, math, time
import regex as re
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine,inspect
from sqlalchemy_utils import create_database, database_exists

In [2]:
# Load data again
# Load title basics file 
basics_df = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)

# Load title rating file 
rating_df = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)

# Load in your csv.gz's of results for combined years
combined = pd.read_csv("Data/tmdb_results_combined.csv.gz", low_memory = False)

In [3]:
# Convert the single string of genres from title basics into 2 new tables

# create a col with a list of genres
basics_df['genres_split'] = basics_df['genres'].str.split(',')
basics_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
136629,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
136630,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
136631,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,[Thriller]
136632,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"
136633,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,[Drama]

In [4]:
# exploding the column of lists
exploded = basics_df.explode('genres_split')
exploded

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
136630,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
136631,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,Thriller
136632,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
136632,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History
136633,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,Drama

In [5]:
# saving the unique values from the exploded column
unique_genres = sorted(exploded['genres_split'].dropna().unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [6]:
# Create a new title_genres table
title_genres = exploded[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [7]:
#  Create a genre mapper dictionary to replace string genres with integers
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [8]:
# Create a new genre_id column using the genre_map dictionary with either .map or .replace.
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)

title_genres = title_genres.drop(columns='genres_split')
title_genres

           tconst  genre_id
0       tt0035423         5
0       tt0035423         9
0       tt0035423        18
1       tt0062336         7
2       tt0069049         7
...           ...       ...
136630  tt9916190        23
136631  tt9916270        23
136632  tt9916362         7
136632  tt9916362        11
136633  tt9916538         7

[237408 rows x 2 columns]

In [9]:
# Convert the genre map dictionary into a dataframe
genre = pd.DataFrame({'Genre_Name' : genre_map.keys(),
                     'Genre_Id': genre_map.values()})
genre.head()

  Genre_Name  Genre_Id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [10]:
 # Extract certain columns
tmdb = combined[['imdb_id','budget','revenue', 'certification']]
tmdb

       imdb_id      budget      revenue certification
0    tt0035423  48000000.0   76019048.0         PG-13
1    tt0118589  22000000.0    5271666.0         PG-13
2    tt0120681  35000000.0   74558115.0             R
3    tt0120737  93000000.0  871368364.0         PG-13
4    tt0120824  38000000.0   24690441.0             R
..         ...         ...          ...           ...
364  tt0288144     88608.0        100.0           NaN
365  tt0303243   1900000.0     240093.0           NaN
366  tt0334482    640000.0          2.0           NaN
367  tt0984240    500000.0     500000.0           NaN
368  tt3180664    200000.0    8000000.0           NaN

[369 rows x 4 columns]

# Discard unnecessary information

In [11]:
# Drop following columns
basics_df = basics_df.drop(['originalTitle','isAdult', 'titleType','genres','genres_split'], axis = 1)
basics_df

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0079644,November 1828,2001,NaN,140
4,tt0088751,The Naked Monster,2005,NaN,100
...,...,...,...,...,...
136629,tt9916170,The Rehearsal,2019,NaN,51
136630,tt9916190,Safeguard,2020,NaN,95
136631,tt9916270,Il talento del calabrone,2020,NaN,84
136632,tt9916362,Coven,2020,NaN,92
136633,tt9916538,Kuambil Lagi Hatiku,2019,NaN,123

# MySQL Database

In [20]:
# loading mysql credentials
with open('C:/Users/ryan/.secret/tmdb_api.json') as f:
    login =json.load(f)
login.keys

In [26]:
# Make connection string
connection = f"mysql+pymysql://'root':{'root'}@localhost/Project-3"
engine = create_engine(connection)
engine

Engine(mysql+pymysql://'root':***@localhost/Project-3)

In [27]:
# create database
create_database(connection)

In [28]:
# Transform to tables
basics_df.to_sql('title_basics', engine, if_exists = 'replace')
rating_df.to_sql('title_rating', engine, if_exists = 'replace')
title_genres.to_sql('title_genres', engine, if_exists = 'replace')
genre.to_sql('genres', engine, if_exists = 'replace')
tmdb.to_sql('tmdb_data', engine, if_exists = 'replace')

369

# Set primary key for title_basics tables

In [29]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics_df['tconst'].fillna('').map(len).max()
title_len = basics_df['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [30]:
# Save to sql with dtype and index=False
basics_df.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

136634

In [31]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [32]:
# show the first 5 rows of the table using a SQL query
q = """
SELECT *
FROM title_basics
LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0079644,November 1828,2001.0,None,140
4,tt0088751,The Naked Monster,2005.0,None,100

# Set primary key for ratings tables

In [36]:
# Calculate max string lengths for object columns
key_len = rating_df['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_2 = {
    "tconst": String(key_len+1),
    'averageRating':Float(),
    'numVotes':Integer()}

In [37]:
# Save to sql with dtype and index=False
rating_df.to_sql('title_rating',engine,dtype=df_2,if_exists='replace',index=False)

103129

In [38]:
# update the table and set the primary key
engine.execute('ALTER TABLE title_rating ADD PRIMARY KEY (`tconst`);')

In [39]:
# show the first 5 rows of the table using a SQL query
q = """
SELECT *
FROM title_rating
LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     84479
1  tt0062336            6.4       161
2  tt0069049            6.7      7324
3  tt0079644            7.3        35
4  tt0088751            5.2       323

# Set primary key for genre tables

In [40]:
# Set the dataframe index and use index=True 
genre.set_index('Genre_Id').to_sql('genres',engine,index=True, if_exists = 'replace')

26

In [41]:
# show the first 5 rows of the table using a SQL query
q = """
SELECT *
FROM genres
LIMIT 5;"""
pd.read_sql(q, engine)

   Genre_Id Genre_Name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

# Set primary key for tmdb tables

In [42]:
# Calculate max string lengths for object columns
key_len = tmdb['imdb_id'].fillna('').map(len).max()
cert_len = tmdb['certification'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_3 = {
    "imdb_id": String(key_len+1),
    'budget':Float(),
    'revenue':Float(),
    "certification":Text(cert_len+1)}

In [43]:
# Save to sql with dtype and index=False
tmdb.to_sql('tmdb_data',engine,dtype=df_3,if_exists='replace',index=False)

369

In [44]:

# update the table and set the primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [45]:

# show the first 5 rows of the table using a SQL query
q = """
SELECT *
FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id      budget      revenue certification
0  tt0035423  48000000.0   76019000.0         PG-13
1  tt0118589  22000000.0    5271670.0         PG-13
2  tt0118694    150000.0   12855000.0            PG
3  tt0120467    120000.0      14904.0             R
4  tt0120630  45000000.0  224835000.0             G

In [46]:
# Show all tables
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_project-3
0              genres
1        title_basics
2        title_genres
3        title_rating
4           tmdb_data